toy_tale_api/app/controllers/api/v1/toys_controller.rb

    def update
        @toy = Api::V1::Toy.find_by_id(params[:id])
        @toy.update(likes: @toy.likes + 1)
---
UPDATE "api_v1_toys" SET "likes" = ?, "updated_at" = ? WHERE "api_v1_toys"."id" = ?  [["likes", 6], ["updated_at", "2020-12-04 06:12:45.617705"], ["id", 1]]